
-- Список разрешенных ИД юнитов,
-- по которым можно устанавливать их количество в городах
-- Непонятно почему, но не по ним устанавливается некорректно
SUCCESS_UNITS_ID = {
  [RACES.HAVEN] = {
    1, 3, 5, 7, 9, 11, 13,
  },
  [RACES.INFERNO] = {
    15, 17, 19, 21, 23, 25, 27,
  },
  [RACES.NECROPOLIS] = {
    29, 31, 34, 35, 37, 39, 41,
  },
  [RACES.SYLVAN] = {
    43, 45, 47, 49, 51, 53, 55,
  },
  [RACES.ACADEMY] = {
    57, 59, 61, 63, 65, 67, 69,
  },
  [RACES.DUNGEON] = {
    92, 73, 75, 77, 79, 81, 83,
  },
  [RACES.FORTRESS] = {
    71, 94, 96, 98, 100, 102, 105,
  },
  [RACES.STRONGHOLD] = {
    117, 119, 121, 123, 125, 127, 129,
  },
};
